package algorithm.bfsdfs;
/**
 * 문제: 토마토
 * 문제 링크: https://www.acmicpc.net/problem/7576
 *
 * 문제 설명:
 * M×N 크기의 상자에 담긴 토마토들이 며칠이 지나면 다 익게 되는지 최소 일수를 구하는 문제입니다.
 *
 * 입력:
 * - 첫 줄: 상자의 크기를 나타내는 두 정수 M, N
 * - 다음 N개의 줄: 상자에 담긴 토마토의 정보 (1: 익은 토마토, 0: 익지 않은 토마토, -1: 토마토가 들어있지 않은 칸)
 *
 * 출력:
 * - 토마토가 모두 익을 때까지 최소 날짜
 * - 저장될 때부터 모든 토마토가 익어있는 상태면 0을, 토마토가 모두 익지 못하는 상황이면 -1을 출력
 *
 * 제한사항:
 * - 2 ≤ M, N ≤ 1,000
 *
 * 접근 방법:
 *
 * 시간 복잡도:
 */
public class BJ_G5_7576_토마토 {
    public void solution(){

    }

    public static void main(){

    }
}
